Repository: sevdog/django-password-validators
Catalog: django_password_validators/locale/*/LC_MESSAGES/django.po
Languages: fi

source: This password must contain at least %(min_length)d digit.
fi: Tämän salasanan tulee sisältää ainakin %(min_length)d numero.

source: This password must contain at least %(min_length)d letter.
fi: Tämän salasanan tulee sisältää ainakin %(min_length)d kirjain.

source: This password must contain at least %(min_length)d upper case letter.
fi: Tämän salasanan tulee sisältää ainakin %(min_length)d iso kirjain.

source: This password must contain at least %(min_length)d lower case letter.
fi: Tämän salasanan tulee sisältää ainakin %(min_length)d pieni kirjain.

source: This password must contain at least %(min_length)d special character.
fi: Tämän salasanan tulee sisältää ainakin %(min_length)d erikoismerkki.

source: %(min_length)s letter
fi: %(min_length)s kirjain

source: %(min_length)s digit
fi: %(min_length)s numero

source: %(min_length)s lower case letter
fi: %(min_length)s pieni kirjain

source: %(min_length)s upper case letter
fi: %(min_length)s iso kirjain

source: %(min_length_alpha)s special character, such as %(special_characters)s
fi: %(min_length_alpha)s erikoismerkki, kuten %(special_characters)s

source: This password must contaion at least
fi: Tämän salasanan tulee sisältää ainakin

source: When created salt
fi: Suolan päiväys

source: Salt for the user
fi: Käyttäjän suola

source: The number of of iterations for Hasher
fi: Tiivisteen iteraatioiden määrä

source: Configuration
fi: Asetus

source: Configurations
fi: Asetukset

source: Password hash
fi: Salasanan tiiviste

source: Date
fi: Päiväys

source: You can not use a password that is already used in this application.
fi: Et voi käyttää aiemmin käyttämääsi salasanaa tässä sovelluksessa.

source: Your new password can not be identical to any of the previously entered.
fi: Uusi salasanasi ei voi olla sama kuin mikään aiemmin käyttämäsi.
